rectangular/OpenFOAM-pimpleFOAM-Rectangular_Cylinder-main/OpenFOAM/case2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.12e-2;

boundaryField
{
    wall1
    {
        type            nutkWallFunction;
        value           $internalField;
    }
	
	wall2
    {
        type            nutkWallFunction;
        value           $internalField;
    }
	
	cylinder
    {
        type            nutkWallFunction;
        value           $internalField;
    }
	
    inlet
    {
        type            zeroGradient;
    }
	
    outlet
    {
        type            zeroGradient;
    }
	
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
